Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: བཙུན་པ་བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོ་གང་ལ་ལ་ཞིག་གིས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཡང་ཉན་འཚལ་བར་འགྱུར། བདག་ཉིད་ལ་ཡང་བསྲུང་བ་ཆེན་པོ་བགྱིད་འཚལ་བར་འགྱུར། བཙུན་མོ་དམ་པ་དང་། རྒྱལ་བུ་རྣམས་དང་། རྒྱལ་པོའི་བུ་མོ་རྣམས་དང་། བཙུན་མོའི་འཁོར་གྱི་ཚོགས་རྣམས་ལ་ཡང་། བསྲུང་བ་ཆེན་པོ་བགྱིད་འཚལ་བར་འགྱུར། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་དེ་ཐམས་ཅད་ལ་ཡང་ཞི་བ་དང་། བདེ་ལེགས་སུ་འགྱུར་བ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ། མཆོག་ཏུ་ཁྱད་པར་དུ་འཕགས་པ། བླ་ན་མེད་པ་བགྱིད་འཚལ་བར་འགྱུར། ཚེ་འདི་ཉིད་ལ་བདག་གི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམ་པར་འཕེལ་བར་བགྱིད་འཚལ་བར་འགྱུར། རྒྱལ་པོ་ཉིད་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པར་འགྱུར། བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མ་མཆིས་པ་ཡང་ཡོངས་སུ་འཛིན་འཚལ་བར་འགྱུར། བདག་གི་ཡུལ་ཐམས་ཅད་ཀྱང་ཀུན་ཏུ་བསྲུང་འཚལ་བར་འགྱུར། ཡོངས་སུ་བསྐྱང་འཚལ་བར་འགྱུར། རང་གི་ཡུལ་ན་གནོད་པ་མ་མཆིས་པ་དང་། དགྲ་མ་མཆིས་པ་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱིས་མི་བརྫི་བ་དང་། ནད་འགོ་བ་མ་མཆིས་པ་དང་། འཁྲུག་པ་མ་མཆིས་པར་བགྱིད་འཚལ་བར་གྱུར་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་མིའི་རྒྱལ་པོ་དེས་གཡེང་བ་མ་མཆིས་པའི་སེམས་དང་། གུས་པ་དང་བཅས་པའི་སེམས་དང་།
en: Then Mahārāja Vaiśravaṇa, Mahārāja Dhṛtarāṣṭra, Mahārāja Virūḍhaka, and Mahārāja Virūpākṣa said to the Bhagavat, “Venerable Bhagavat, the human king who wishes to listen to this Lord King of Sūtras, the Sublime Golden Light, and who wishes to have a great guardianship for himself; who wishes for a great guardianship for all his queens, their princes and princesses, and the harem; who wishes to bring the highest, superior, inconceivable great peace and well-being to his entire court; who wishes to increase his great sovereignty inconceivably in his lifetime; who wishes to possess inconceivable kingship; who wishes to possess an incalculable accumulation of merit; who wishes for his entire domain to be completely guarded; who wishes for it to be protected; who wishes for there to be no harm to his domain; and who wishes for there to be no enemies, no oppression from enemy armies, no disease, and no disturbances—venerable Bhagavat, that human king, with an undistracted mind, with veneration and service, should listen respectfully to this Lord King of Sūtras, the Sublime Golden Light.

source: རིམ་གྲོ་དང་བཅས་པས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི། བསྟི་སྟང་དུ་བགྱིས་ཏེ་མཉན་པར་བགྱིའོ། །གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་མཉན་པའི་སླད་དུ། མིའི་རྒྱལ་པོ་དེས། རྒྱལ་པོའི་ཕོ་བྲང་ཁྱད་པར་དུ་འཕགས་པར་མཆི་བར་བགྱིའོ། །
en: “In order to listen to this Lord King of Sūtras, the Sublime Golden Light, that human king should enter a superior royal palace.

source: དེར་མཆིས་ནས་ཀྱང་། རྒྱལ་པོའི་ཕོ་བྲང་སྤོས་ཆབ་སྣ་ཚོགས་ཀྱིས་ཆག་ཆག་གདབ་ཅིང་། མེ་ཏོག་སིལ་མ་སྣ་ཚོགས་དགྲམ་པར་བགྱིའོ། །
en: Having entered, he should sprinkle perfume and scatter a variety of flower petals in the royal palace.

source: སྤོས་ཆབ་སྣ་ཚོགས་ཀྱིས་ཆག་ཆག་བཏབ་པ་དེར་ཆོས་ཀྱི་ཁྲི་མཐོན་པོ་རྒྱན་སྣ་ཚོགས་ཀྱིས་ལེགས་པར་བརྒྱན་པ་བཤམ་པར་བགྱིའོ། །
en: Where the perfume has been sprinkled, he should set up a high Dharma throne, well adorned with a variety of adornments.

source: ཕྱོགས་དེར་གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་སྣ་ཚོགས་ཀྱིས་ལེགས་པར་བརྒྱན་པར་བགྱིའོ། །
en: He should adorn that place well with a variety of parasols, banners, and flags.

source: མིའི་རྒྱལ་པོ་དེས་ལུས་བཀྲུ་བར་བགྱིའོ། །གོས་དྲི་རབ་ཏུ་བདའ་བ།
en: That human king should wash his body.

source: གོས་སར་པ་མཛེས་པ་བགོས་ནས། རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པར་བགྱིའོ། །
en: He should put on new, perfectly clean clothes and adorn himself with various kinds of jewelry.

source: བདག་གི་སྟན་རབ་ཏུ་དམའ་བ་གདིང་བར་བགྱི་སྟེ། སྟན་དེ་ལ་མཆིས་ནས། རྒྱལ་པོའི་རྒྱགས་པས་དྲེགས་པར་མི་བགྱིའོ། །
en: He should set out for himself a low seat, and seated on that he should not have the arrogant conceit of a king.

source: དེར་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ལ་ཆགས་པར་མི་བགྱིའོ། །རྒྱགས་པ་དང་།
en: “He should have no attachment to the power of kingship.

source: ང་རྒྱལ་དང་། དྲེགས་པ་ཐམས་ཅད་རྣམ་པར་སྤངས་པའི་སེམས་ཀྱིས། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་མཉན་པར་བགྱིའོ། །
en: With a mind devoid of all arrogance, pride, and conceit, he should listen to this Lord King of Sūtras, the Sublime Golden Light.

source: དགེ་སློང་ཆོས་སྨྲ་བ་དེ་ལ་ཡང་སྟོན་པར་འདུ་ཤེས་བསྐྱེད་པར་བགྱིའོ། །
en: He should also perceive the dharmabhāṇaka bhikṣu as a teacher.

source: མིའི་རྒྱལ་པོ་དེས་དེའི་ཚེ་དེའི་དུས་ན། བཙུན་མོ་དམ་པ་དང་། རྒྱལ་བུ་རྣམས་དང་། རྒྱལ་པོའི་བུ་མོ་རྣམས་དང་། བཙུན་མོའི་འཁོར་གྱི་ཚོགས་རྣམས་ལ་སྡུག་པ་དང་།
en: “That human king, at that time, in that time, should regard his principal queen, princes, princesses, and harem in a pleasing and beneficial way.

source: ཕན་པས་བལྟ་བར་བགྱིའོ། །བཙུན་མོ་དམ་པ་རྣམས་དང་། རྒྱལ་བུ་རྣམས་དང་། རྒྱལ་པོའི་བུ་མོ་རྣམས་ལ་ཚིག་སྙན་པ་སྨྲ་བར་བགྱིའོ། །བཙུན་མོའི་འཁོར་གྱི་ཚོགས་ཐམས་ཅད་ལ་ཡང་ཚིག་སྙན་པ་སྨྲ་བར་བགྱིའོ། །
en: He should speak to his principal queen, princes, princesses, and harem with pleasant words.

source: ཆོས་མཉན་པའི་ཕྱིར་མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་སྦྱོར་དུ་སྩལ་བར་བགྱིའོ། །
en: He should have various offerings assembled for listening to the Dharma.

source: དགའ་བ་བསམ་གྱིས་མི་ཁྱབ་ཅིང་མཚུངས་པ་མ་མཆིས་པས། བདག་ཚིམ་པར་བགྱིའོ། །
en: He should be delighted by inconceivable, unequaled joy.

source: དགའ་བ་དང་བདེ་བ་བསམ་གྱིས་མི་ཁྱབ་པས་བདེ་བར་བགྱིའོ། །
en: He should be blissful with inconceivable joy and happiness.

source: དབང་པོ་བདེ་བར་བགྱིའོ། །
en: He should have delighted senses.

source: བདག་ཉིད་དོན་ཆེན་པོ་ཐོབ་པར་བསམ་པར་བགྱིའོ། །
en: He should think he will attain a great benefit.

source: བདག་དགའ་བ་ཆེན་པོས་དགའ་བར་བགྱིའོ། །
en: He should be delighted with a great delight.

source: རབ་ཏུ་དགའ་བ་ཆེན་པོ་བསྐྱེད་ནས། ཆོས་སྨྲ་བ་བསུ་བར་བགྱིའོ། །
en: He should welcome the dharmabhāṇaka with great pleasure.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྒྱལ་པོ་ཆེན་པོ་དག་དེའི་ཚེ་དེའི་དུས་ན། མིའི་རྒྱལ་པོ་དེས་གོས་ཐམས་ཅད་དཀར་པོ་སར་པ་མཛེས་པ་བགོ་བར་བྱའོ། །
en: After they had spoken, the Bhagavat said to the Four Mahārājas, “Mahārājas, at that time, in that time, that human king should wear clothes that are all white, beautiful, and new.

source: སྤུད་པ་དང་། རྒྱན་སྣ་ཚོགས་ཀྱིས་བདག་ལེགས་པར་བརྒྱན་པར་བྱའོ། །
en: He should adorn himself well with various adornments and jewelry.

source: གདུགས་དཀར་པོ་ཡང་གཟུང་བར་བྱའོ། །
en: He should hold a white parasol.

source: རྒྱལ་པོའི་མཐུ་ཆེན་པོ་དང་། རྒྱལ་པོའི་བཀོད་པ་ཆེན་པོས་བཀྲ་ཤིས་ཐ་དད་པ་སྣ་ཚོགས་ཐོགས་ཏེ། རྒྱལ་པོའི་ཕོ་བྲང་དེ་ནས་བྱུང་ལ་ཆོས་སྨྲ་བ་དེ་བསུ་བའི་ཕྱིར་དེར་འགྲོ་བར་བྱའོ། །
en: With great royal power and a great royal display, he should hold various auspicious articles and leave the royal palace to go to welcome the dharmabhāṇaka.

source: མིའི་རྒྱལ་པོས་དེར་གོམ་པ་ཇི་སྙེད་བོར་བ། དེ་སྙེད་ཀྱི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་འབུམ་གྱི་འཁོར་བ་ཕྱིར་བསྙིལ་བར་འགྱུར། དེ་སྙེད་ཀྱི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་རིགས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་འཐོབ་པར་འགྱུར།
en: It is because however many steps the human king takes, that number of hundreds of thousands of quintillions of eons in saṃsāra is eliminated, and he will become a cakravartin king that number of hundreds of thousands of quintillions of times.

source: དེར་གོམ་པ་ཇི་སྙེད་བོར་བ་དེ་སྙེད་དུ་ཚེ་འདི་ལ་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་འཕེལ་བར་འགྱུར།
en: However many steps he takes, in that lifetime his great sovereignty will increase inconceivably that number of times.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མར་གནས་ཡངས་ཤིང་རྒྱ་ཆེ་བ། ལྷའི་གཞལ་མེད་ཁང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་པ་དག་འཐོབ་པར་འགྱུར།
en: He will attain as his abode for many hundreds of thousands of quintillions of eons a vast and immense divine aerial palace made of the seven precious materials.

source: མི་རྣམས་ཀྱིས་རྒྱལ་རིགས་དང་། ལྷའི་རྒྱ་ཆེ་ཞིང་རྒྱ་ཆེ་བ་འབུམ་ཕྲག་དུ་མ་འཐོབ་པར་འགྱུར། སྐྱེ་བ་ཐམས་ཅད་དུ་དབང་ཕྱུག་ཆེན་པོ་ཐོབ་པར་འགྱུར། ཚེ་རིང་བར་འགྱུར། ཡུན་རིང་དུ་འཚོ་བར་འགྱུར། སྤོབས་པ་དང་ལྡན་པར་འགྱུར། ཚིག་གཟུང་བར་འོས་པར་འགྱུར། གྲགས་པ་དང་ལྡན་པར་འགྱུར། བརྗོད་པ་ཤིན་ཏུ་རྒྱ་ཆེ་བར་འགྱུར། བསྔགས་པར་འོས་པར་འགྱུར།
en: He will obtain hundreds of thousands of human royal families and a vastness that is a divine vastness.

source: ལྷ་དང་མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ལ་ཕན་པར་འགྱུར། ལྷ་དང་མི་རྣམས་ཀྱི་བདེ་བ་རྒྱ་ཆེ་ཞིང་རྒྱ་ཆེ་བ་ཐོབ་པར་འགྱུར། སྟོབས་ཆེ་བར་འགྱུར། ཚན་པོ་ཆེ་ཆེན་པོའི་སྟོབས་ཀྱི་ཤུགས་དང་ལྡན་ཞིང་གཟུགས་བཟང་བར་འགྱུར། མཛེས་པ་དང་། བལྟ་ན་སྡུག་པ་དང་། ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པར་འགྱུར། སྐྱེ་བ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་དང་ཕྲད་པར་འགྱུར། དགེ་བའི་བཤེས་གཉེན་རྣམས་རྙེད་པར་འགྱུར།
en: In all his lifetimes, he will have great sovereignty; he will have a long life; he will live for a long time; he will have eloquence; he will be an excellent speaker; he will be famous; he will be widely renowned; he will be worthy of praise; he will benefit the world and its devas and asuras; he will attain the vast, vast happiness of devas and humans; he will have great might; he will possess the power of the strength of a great champion; he will be handsome and attractive; he will possess a perfectly developed, excellent color; in all his lifetimes he will meet a tathāgata; he will obtain a kalyāṇamitra; and he will possess an incalculable aggregation of merit.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་གཟུང་བར་འགྱུར་ཏེ། རྒྱལ་པོ་ཆེན་པོ་དག་ཡོན་ཏན་གྱི་ཕན་ཡོན་འདི་ལྟ་བུ་དག་མཐོང་ནས། མིའི་རྒྱལ་པོ་དེས་དཔག་ཚད་ཙམ་དུ་ཆོས་སྨྲ་བ་ལ་བསུ་བར་བྱ། དཔག་ཚད་བརྒྱ་དང་། དཔག་ཚད་སྟོང་དུ་ཡང་བསུ་བར་བྱ།
en: “Mahārājas, seeing the benefit of such qualities, the human king should go a yojana to greet the dharmabhāṇaka—he should go a hundred yojanas, a thousand yojanas, to greet him.

source: ཆོས་སྨྲ་བ་དེ་ལ་སྟོན་པར་འདུ་ཤེས་བསྐྱེད་པར་བྱའོ། །
en: He should conceive of that dharmabhāṇaka as the Teacher.

source: ཡང་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེང་བདག་གི་རྒྱལ་པོའི་ཕོ་བྲང་འདིར་འཇུག་པར་འགྱུར་རོ། །
en: He should think, ‘Today, the tathāgata arhat samyaksaṃbuddha Śākyamuni will enter my royal palace.

source: དེང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ། བདག་གི་རྒྱལ་པོའི་ཕོ་བྲང་འདིར་བཤོས་གསོལ་བར་འགྱུར་རོ། །
en: Today, the tathāgata arhat samyaksaṃbuddha Śākyamuni will take his meal in my royal palace.

source: དེང་བདག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པའི་ཆོས་འཇིག་རྟེན་ཐམས་ཅད་དང་མི་མཐུན་པ་མཉན་པར་བྱའོ། །
en: Today, I will hear the Dharma of the tathāgata arhat samyaksaṃbuddha Śākyamuni, which is contrary to all worlds.

source: དེང་བདག་གིས་ཆོས་མཉན་པ་འདིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱའོ། །
en: Today, through hearing the Dharma, I will progress irreversibly toward the highest, most complete enlightenment.

source: དེང་བདག་གིས་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་མཉེས་པར་བྱས་པར་འགྱུར་རོ། །
en: Today I have pleased many hundreds of thousands of quintillions of tathāgatas.

source: དེང་བདག་གིས་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ། མཆོད་པ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་བྱས་པར་འགྱུར་རོ། །
en: Today I have made an immense, vast, inconceivably great offering to the buddha bhagavats of the past, the future, and the present.

source: དེང་བདག་གིས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་ཐམས་ཅད་ཤིན་ཏུ་རྒྱུན་ཆད་པར་འགྱུར་རོ། །
en: Today I have brought to an end all the suffering in the hells, in rebirth as animals, and in the land of Yama.

source: དེང་བདག་གིས་ཚངས་པའི་དབང་པོའི་རྒྱལ་པོ་ཉིད་ཀྱི་ལུས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་འཐོབ་པ་དག་གི་དགེ་བའི་རྩ་བའི་ས་བོན་བསྐྱེད་པར་འགྱུར་རོ། །
en: Today I have planted the roots of merit that are the seed for attaining many hundreds of thousands of quintillions of the bodies of a king and a lord of the Brahmā devas.

source: དེང་བདག་གིས་བརྒྱ་བྱིན་ཉིད་ཀྱི་ལུས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་འཐོབ་པ་དག་གི་དགེ་བའི་རྩ་བའི་ས་བོན་བསྐྱེད་པར་འགྱུར་རོ། །
en: Today I have planted the roots of merit that are the seed for attaining many hundreds of thousands of quintillions of the bodies of a Śakra.

source: དེང་བདག་གིས་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཉིད་ཀྱི་ལུས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་འཐོབ་པ་དག་གི་དགེ་བའི་རྩ་བའི་ས་བོན་བསྐྱེད་པར་འགྱུར་རོ། །
en: Today I have planted the roots of merit that are the seed for attaining many hundreds of thousands of quintillions of the bodies of a cakravartin king.

source: དེང་བདག་གིས་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མར་འཁོར་བ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་པར་འགྱུར་རོ། །
en: Today I have attained liberation from saṃsāra for many hundreds of thousands of quintillions of eons.

source: དེང་བདག་གིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་དཔག་ཏུ་མེད་པ་བླ་ན་མེད་པ་ཡངས་ཤིང་རྒྱ་ཆེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་གཟུང་བར་འགྱུར་རོ། །
en: Today I have obtained an immense, vast, unsurpassable, inconceivable aggregation of merit.

source: དེང་བདག་གིས་བཙུན་མོའི་འཁོར་གྱི་ཚོགས་ཐམས་ཅད་ལ་བསྲུང་བ་ཆེན་པོ་བྱས་པར་འགྱུར་རོ། །
en: Today I have created a great guardianship for all in my harem.

source: དེང་བདག་གིས་རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་འདིར་ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བ་བསམ་གྱིས་མི་ཁྱབ་པ། མཆོག་ཏུ་ཁྱད་པར་དུ་འཕགས་པ་བླ་ན་མེད་པ་བྱས་པར་འགྱུར་རོ། །
en: Today I have brought the highest, superior, perfect, inconceivable peace and well-being to this royal palace.

source: དེང་བདག་གིས་ཡུལ་འདི་དག་ཐམས་ཅད་ཀུན་ཏུ་བསྲུངས་པར་འགྱུར་རོ། །ཡོངས་སུ་བསྐྱངས་པ་དང་།
en: Today I have guarded this entire domain.

source: གནོད་པ་མེད་པ་དང་། དགྲ་མེད་པ་དང་། ཕ་རོལ་གྱི་དམག་ཚོགས་ཐམས་ཅད་ཀྱིས་མི་བརྫི་བ་དང་། ནད་འགོ་བ་མེད་པ་དང་། འཁྲུག་པ་མེད་པར་འགྱུར་རོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ། །རྒྱལ་པོ་ཆེན་པོ་དག་དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛིན་པ། དེ་དག་ལ་མིའི་རྒྱལ་པོ་དེ་དམ་པའི་ཆོས་ལ་གུས་པ་དེ་ལྟ་བུས་བསྟི་སྟང་བྱེད། བླ་མར་བྱེད། རིམ་གྲོར་བྱེད།
en: It will be defended, unharmed, without enemies, and without the oppression of invading armies, disease, and disturbances.’

source: མཆོད་པར་བྱེད་ཅིང་། རྒྱལ་པོ་ཆེན་པོ་ཁྱེད་བཞི་དཔུང་དང་གཡོག་ཏུ་བཅས་པ་དང་། ལྷའི་ཚོགས་དེ་དག་དང་གནོད་སྦྱིན་འབུམ་ཕྲག་དུ་མ་དག་ལ་ཤས་ཀྱིས་དམ་པ་བྱིན་ན། མིའི་རྒྱལ་པོ་དེ་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་དང་། དགེ་བ་མངོན་པར་འདུ་བྱེད་པ་དེ་དང་།
en: “Mahārājas, if the king who with this reverence for the Dharma honors, venerates, worships, and makes offerings to the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess The Lord King of Sūtras, the Sublime Golden Light, and dedicates the best part to you Four Mahārājas, your army, your attendants, the host of devas, and the many hundred thousands of yakṣas, then he will manifest the merit, he will manifest the good karma, and in that life his great sovereignty will increase incalculably.

source: ཚེ་འདིའི་ལུས་ཀྱི་རྒྱལ་སྲིད་ཀྱི་དབང་ཕྱུག་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་དེས་རྣམ་པར་འཕེལ་བར་འགྱུར། ཚེ་འདི་ལ་རྒྱལ་པོའི་གཟི་བརྗིད་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་ལྡན་པར་འགྱུར་རོ། །དཔལ་དང་། ཕུན་སུམ་ཚོགས་པ་དང་། གཟི་བརྗིད་ཀྱིས་ཀྱང་བརྒྱན་པར་འགྱུར་རོ། །
en: In that life he will possess the incalculable great magnificence of a king, and he will be adorned by splendor, good fortune, and magnificence.

source: ཕྱིར་རྒོལ་བ་ཐམས་ཅད་དང་། དགྲ་ཐམས་ཅད་ཆོས་དང་མཐུན་པར་ཤིན་ཏུ་ཚར་ཆོད་པར་འགྱུར་རོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: All his opponents will be eliminated, in accord with the Dharma, together with all his enemies.”

source: བཅོམ་ལྡན་འདས་ལ་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གང་ལ་ལ་ཞིག་མིའི་རྒྱལ་པོར་གྱུར་ལ། དེ་ཆོས་ལ་གུས་པ་དེ་ལྟ་བུས། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ཉན་ལ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛིན་པ་དེ་དག་ལ་ཡང་བསྟི་སྟང་བགྱིད། བླ་མར་བགྱིད། རིམ་གྲོར་བགྱིད། མཆོད་པར་བགྱིད་ཅིང་། རྒྱལ་པོ་ཆེན་པོ་བདག་ཅག་གི་སླད་དུ།
en: When the Bhagavat had said that, the Four Mahārājas said to him, “Venerable Bhagavat, if there is a human king with such a reverence for the Dharma as that—one who honors, venerates, worships, and makes offerings to the bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who possess the Lord King of Sūtras, and who, for our sake, purifies and cleans the royal palace, and sprinkles it well with various perfumes—then he will be listening to the Dharma together with us, the Four Mahārājas.

source: རྒྱལ་པོའི་ཕོ་བྲང་དེ་ཤིན་ཏུ་དག་པར་ཕྱག་དར་བགྱིད། སྤོས་ཆབ་སྣ་ཚོགས་ཀྱིས་ཆག་ཆག་ལེགས་པར་འདེབས་ལ། བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། ལྷན་ཅིག་ཏུ་ཐུན་མོང་དུ་ཆོས་མཉན་པ་དེ་ཉན་ཅིང་བདག་དང་ལྷ་ཐམས་ཅད་ཀྱི་སླད་དུ་དགེ་བའི་རྩ་བའི་ཤས་ཅུང་ཟད་ཅིག་སྦྱིན་པར་བགྱིད་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་དགེ་སློང་ཆོས་སྨྲ་བ་དེ་ཆོས་ཀྱི་སྟན་ལ་མཆིས་མ་ཐག་ཏུ།
en: If he gives a little share of his roots of merit to us and all devas, then, venerable Bhagavat, as soon as the dharmabhāṇaka bhikṣu comes to his seat, that king, for the sake of us, the Four Mahārājas, should spread the aroma of various scents.

source: མིའི་རྒྱལ་པོ་དེས་བདག་ཅག་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་དོན་གྱི་སླད་དུ། སྤོས་སྣ་ཚོགས་ཀྱིས་བདུག་པར་བགྱིའོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་དེ་ལ་མཆོད་པའི་སླད་དུ། བདུག་པས་བདུགས་མ་ཐག་ཏུ་སྤོས་སྣ་ཚོགས་རྣམས་ལས། སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་དག་འབྱུང་བར་འགྱུར་ཏེ།
en: “Venerable Bhagavat, as soon as he perfumes with various scents, in order to make an offering to The Lord King of Sūtras, the Sublime Golden Light, from the various aromas there will appear vines of various perfumes and incenses.

source: དེ་དག་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ། རྒྱལ་པོ་ཆེན་པོ་བདག་ཅག་བཞིའི་རང་རང་གི་ཁང་པའི་སྟེང་གི་བར་སྣང་ལ། སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་དག་གི་གདུགས་རྣམས་སུ་གནས་པར་འགྱུར་རོ། །སྤོས་ཀྱི་དྲི་རྒྱ་ཆེན་པོ་ཡང་མནམ་པར་འགྱུར།
en: In that instant, that moment, that fraction of a second, in the sky above each of our palaces, the palaces of the Four Mahārājas, there will be present a parasol composed of the vines of various perfumes and incenses and there will spread a vast aroma.

source: གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་སྣང་བ་འབྱུང་བར་འགྱུར་ཞིང་སྣང་བ་དེས་བདག་ཅག་གི་ཁང་པ་རྣམས་ཀྱང་སྣང་བ་བགྱིས་པར་འགྱུར་རོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་སྤོས་དང་། བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་དག་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་དང་། ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་དང་། ལྷ་མོ་ཆེན་མོ་བརྟན་མ་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས་དང་།
en: There will appear a golden light that will illuminate our palaces.

source: གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་། ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ལག་ན་རྡོ་རྗེ་དང་། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ནོར་བུ་བཟང་དང་། འཕྲོག་མའི་བུ་ལྔ་བརྒྱ་འཁོར་དང་ལྡན་པ་དང་། ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་མ་དྲོས་པ་དང་། ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་རྒྱ་མཚོ་དང་།
en: “Venerable Bhagavat, the vines of various perfumes and incenses, in that instant, that moment, that fraction of a second, will appear as parasols composed of vines of various perfumes and incenses present in the sky above the palaces of Brahmā, lord of Sahā; of Śakra, lord of the devas; of the great goddess Sarasvatī; of the great goddess Dṛḍhā; of the great goddess Śrī; of the great yakṣa general Saṃjñeya and the other twenty-eight great yakṣa generals; of the great deity Maheśvara; of the great yakṣa general Vajrapāṇi; of the great yakṣa general Māṇibhadra; of Hārītī with her entourage of five hundred children; of the nāga king Anavatapta; and of the nāga king Sāgara.

source: དེ་དག་རང་རང་གི་ཁང་པའི་སྟེང་གི་བར་སྣང་ལ་བྱུང་སྟེ། སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་གི་གདུགས་རྣམས་སུ་གནས་པར་འགྱུར། སྤོས་དྲི་སྣ་ཚོགས་རྒྱ་ཆེན་པོ་ཡང་མནམ་པར་འགྱུར། ཁང་པ་རྣམས་ཀྱི་ནང་དུ་གསེར་དུ་སྣང་བ་འབྱུང་བར་འགྱུར་ཞིང་། སྣང་བ་དེས་གནས་ཐམས་ཅད་སྣང་བ་བགྱིས་པར་འགྱུར་རོ། །
en: A vast aroma will spread, and a golden light will appear inside those palaces and that light will illuminate everything.”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རྒྱལ་པོ་ཆེན་པོ་དག་རྒྱལ་པོ་ཆེན་པོ་ཁྱེད་བཞིའི་རང་རང་གི་ཁང་པ་རྣམས་ཀྱི་སྟེང་གི་བར་སྣང་ལ། སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་དེ་དག་གདུགས་རྣམས་སུ་གནས་པར་མ་ཟད་དོ། །
en: When the Four Mahārājas had said that, the Bhagavat said to them, “Mahārājas, parasols comprised of vines of various perfumes and incenses will be present not only in the sky above the palaces of each of you Four Mahārājas.

source: རྒྱལ་པོ་ཆེན་པོ་དག །མིའི་རྒྱལ་པོ་དེས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལ་མཆོད་པའི་ཕྱིར། སྤོས་སྣ་ཚོགས་དེ་དག་གིས་བདུགས་མ་ཐག་ཏུ་ལག་ན་པོག་སྣོད་ཅིག་ཐོགས་པ་དེ་ལས། སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་རྣམས་འབྱུང་བར་འགྱུར་ཏེ། དེ་དག་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་དག་ཐམས་ཅད་ན་གང་ན་ཟླ་བ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། ཉི་མ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། རྒྱ་མཚོ་ཆེན་པོ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། རིའི་རྒྱལ་པོ་རི་རབ་བྱེ་བ་ཕྲག་བརྒྱ་དང་།
en: As soon as the human king perfumes with those aromas as an offering to The Lord King of Sūtras, the Sublime Golden Light, there will arise from the censer in his hands vines of perfumes and incense.

source: རིའི་རྒྱལ་པོ་འཁོར་ཡུག་དང་། འཁོར་ཡུག་ཆེན་པོ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་ཕྲག་བརྒྱ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་བྱེ་བ་ཕྲག་བརྒྱ་དང་སུམ་ཅུ་རྩ་གསུམ་བྱེ་བ་ཕྲག་བརྒྱ་ནས། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་དུ་ཉེ་བར་སོང་བའི་བར་གྱི་ལྷ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཐམས་ཅད་དུ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་རིས་བྱེ་བ་ཕྲག་བརྒྱ་པོ་ཐམས་ཅད་ན། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: In that instant, in that moment, in that fraction of a second, throughout all the world realms in the trichiliocosm—where there are a billion moons, a billion suns, a billion great oceans, a billion Sumeru kings of mountains, a billion Cakravāḍa and Mahācakravāḍa kings of mountains, a billion four-continent world realms, a billion Cāturmahā­rāja­kāyikas, a billion Trāyastriṃśas, and so on, up to a billion paradises of the state of neither perception nor nonperception—throughout all those world realms in the billion world realms, there will be parasols composed of those vines of incenses and perfumes in the sky above the palaces of the hosts of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོའི་ཚོགས་རྣམས་ཀྱི་རང་རང་གི་ཁང་པ་དག་གི་སྟེང་གི་བར་སྣང་ལ། སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་དེ་དག་གདུགས་རྣམས་སུ་གནས་པར་འགྱུར། སྤོས་དྲི་རྒྱ་ཆེན་པོ་ཡང་མནམ་པར་འགྱུར། ལྷའི་ཁང་པ་རྣམས་སུ་གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་སྣང་བ་ཡང་འབྱུང་བར་འགྱུར་ཞིང་སྣང་བ་དེས་ཀྱང་ལྷའི་ཁང་པ་རྣམས་སྣང་བ་བྱས་པར་འགྱུར་རོ། །རྒྱལ་པོ་ཆེན་པོ་དག་འདི་ལྟར་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། ལྷའི་ཁང་པ་ཐམས་ཅད་ཀྱི་སྟེང་གི་བར་སྣང་ལ། སྤོས་དང་བདུག་པའི་འཁྲི་ཤིང་དེ་དག་གདུགས་རྣམས་སུ་གནས་པ་དེ་བཞིན་དུ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལ་མཆོད་པའི་ཕྱིར། མིའི་རྒྱལ་པོ་དེས། སྤོས་སྣ་ཚོགས་དེ་དག་གིས་བདུགས་མ་ཐག་ཏུ།
en: A vast aroma will spread, and a golden light will appear inside those divine palaces and that light will illuminate everything.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདིའི་གཟི་བརྗིད་ཀྱི་མཐུས། སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་དག་འབྱུང་བར་འགྱུར་ཏེ། དེ་དག་སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་དེ་ལ་ཀུན་ཏུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དུ་མ། གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་རྣམས་སུ་དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ། གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་གི་བར་སྣང་ལ།
en: “Mahārājas, just as parasols composed of vines of incenses and perfumes are present above all the divine palaces in the trichiliocosm world realm, in the same way, as soon as the king makes an offering by perfuming with scent The Lord King of Sūtras, the Sublime Golden Light, then through the power of the magnificence of this Lord King of Sūtras, the Sublime Golden Light there will appear vines of perfume and incense, and in that instant, in that moment, in that fraction of a second, parasols composed of vines of incenses and perfumes will be present in the sky above the many hundreds of thousands of quintillions of tathāgatas, as numerous as the sand grains of the Ganges River, who are in the hundreds of thousands of quintillions of buddha realms, as numerous as the sand grains of the Ganges River, that are in the many world realms in the ten directions.

source: སྤོས་དང་བདུག་པ་སྣ་ཚོགས་ཀྱི་འཁྲི་ཤིང་རྣམས་སུ་གནས་པར་འགྱུར། དེ་དག་ཀྱང་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་ལ། སྤོས་དང་བདུག་པ་སྣ་ཚོགས་རྒྱ་ཆེ་ཞིང་རྒྱ་ཆེ་བ་མནམ་པར་འགྱུར།
en: They will perfume many hundreds of thousands of quintillions of buddhas with an extremely vast variety of perfumes and incenses.
